#+title: Vespa_howto

** Querying

#+BEGIN_SRC python :session VESPA_HOWTO.org  :exports both
from vespa.io import VespaQueryResponse
import json
from vespa.application import Vespa

query = "object detection"

topk = 25
app = Vespa(url="http://localhost", port=8080)
response:VespaQueryResponse = app.query(
    yql=f"select id,name,chunk,metadata from colbert where userQuery() or ({{targetHits:{topk*4}}}nearestNeighbor(embedding,q)) limit {topk}",
    groupname="admin",
    ranking="colbert",
    query=query,
    body={
        "presentation.format.tensors": "short-value",
        "input.query(q)": f"embed(e5, \"{query}\")",
        "input.query(qt)": f"embed(colbert, \"{query}\")",
    }
)
assert(response.is_successful())
results = json.dumps(response.hits[0], indent=2)
response.hits[0]["fields"]["metadata"]
#+END_SRC

#+RESULTS:
| repo_name | : | DetectionTeamUCAS/FCOS_GluonCV | id | : | 56 | tasks | : | [semantic segmentation, pedestrian detection, object detection] |

#+BEGIN_SRC python :session VESPA_HOWTO.org  :exports both
len(response.hits)
#+END_SRC

#+RESULTS:
: 25

#+BEGIN_SRC python :session VESPA_HOWTO.org  :exports both
[hit["fields"]["metadata"]["repo_name"] for hit in response.hits]
#+END_SRC

#+RESULTS:
| DetectionTeamUCAS/FCOS_GluonCV | DetectionTeamUCAS/FCOS_GluonCV | linspace100/AI_traffic_police | TencentYoutuResearch/PedestrianDetection-NohNMS | TencentYoutuResearch/PedestrianDetection-NohNMS | linspace100/AI_traffic_police | xytpai/DetX-FCOS | linspace100/AI_traffic_police | xytpai/DetX-FCOS | linspace100/AI_traffic_police | TencentYoutuResearch/PedestrianDetection-NohNMS | kinglintianxia/KittiSeg | xytpai/DetX-FCOS | facebookresearch/habitat-sim | xytpai/DetX-FCOS | wangguojun2018/CenterNet3d | lijx10/USIP | lijx10/USIP | skumar9876/FCRL | lijx10/USIP | lijx10/USIP | CSAILVision/semantic-segmentation-pytorch | cfzd/Ultra-Fast-Lane-Detection | bethgelab/notorious_difficulty_of_comparing_human_and_machine_perception | arbellea/DeepCellSeg |

